ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "6"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "6"
    output: "7"
    name: "Reshape_1"
    op_type: "Reshape"
  }
  node {
    input: "7"
    output: "8"
    name: "Transpose_2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }
  }
  node {
    input: "8"
    output: "9"
    name: "ReduceMean_3"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "8"
    output: "10"
    name: "ReduceMean_4"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "8"
    input: "10"
    output: "11"
    name: "Sub_5"
    op_type: "Sub"
  }
  node {
    input: "11"
    input: "11"
    output: "12"
    name: "Mul_6"
    op_type: "Mul"
  }
  node {
    input: "12"
    output: "13"
    name: "ReduceMean_7"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "input"
    input: "weight"
    input: "bias"
    input: "9"
    input: "13"
    output: "14"
    output: "15"
    output: "16"
    output: "batch_norm_dead_output-26"
    output: "batch_norm_dead_output-27"
    name: "BatchNormalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    data_type: 1
    name: "weight"
    raw_data: "\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "bias"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "14"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
